fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ПлановыеОтпуска</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ПлановыеОтпуска/ВКМ_ПлановыеОтпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ПлановыеОтпуска</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ДнейОтпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Год) Тогда
		Год = Число(Формат(ТекущаяДатаСеанса(), "ДФ=yyyy"));
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(Год) Тогда
		Возврат;
	КонецЕсли;
	
	НачалоПериода = Дата(Год, 1, 1);
	КонецПериода = КонецГода(НачалоПериода);
	
	Для Каждого СтрокаОтпуска Из ОтпускаСотрудников Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаОтпуска.ДатаНачала)
			Или Не ЗначениеЗаполнено(СтрокаОтпуска.ДатаОкончания) Тогда
			Продолжить;
		КонецЕсли;
		
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ОтпускаСотрудников",
			СтрокаОтпуска.НомерСтроки, "ДатаНачала");
		
		Если СтрокаОтпуска.ДатаНачала > СтрокаОтпуска.ДатаОкончания Тогда
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'Строка %1: дата начала больше даты окончания.'"),
					СтрокаОтпуска.НомерСтроки),
				ЭтотОбъект, Поле, , Отказ);
		ИначеЕсли СтрокаОтпуска.ДатаНачала < НачалоПериода
			Или СтрокаОтпуска.ДатаОкончания > КонецПериода Тогда
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'Строка %1: отпуск должен быть в пределах года графика.'"),
					СтрокаОтпуска.НомерСтроки),
				ЭтотОбъект, Поле, , Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВКМ_ПлановыеОтпуска.Записывать = Истина;
	
	Для Каждого СтрокаОтпуска Из ОтпускаСотрудников Цикл
		Движение = Движения.ВКМ_ПлановыеОтпуска.Добавить();
		Движение.Период = НачалоДня(СтрокаОтпуска.ДатаНачала);
		Движение.Сотрудник = СтрокаОтпуска.Сотрудник;
		Движение.ДнейОтпуска = (НачалоДня(СтрокаОтпуска.ДатаОкончания)
			- НачалоДня(СтрокаОтпуска.ДатаНачала)) / 86400 + 1;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
